ХМНПФ_Общее/Documents/ИФРС17_ВыделениеГруппПодгруппНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИФРС17_ВыделениеГруппПодгруппНПО</Name>
		</Properties>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_СчетчикНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СчетчикНачислений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_СрезСчетчикНачисленийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_СрезСчетчикНачисленийНПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СхемаСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СхемаСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодичностьВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_РазмерПенсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РазмерПенсии</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолныйРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоличествоНазначенныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоличествоНазначенныхВыплат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыПенсионныхСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыПенсионныхСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПожизненныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоИсчерпанияСредствНаСчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежегодно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Единовременно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПоТребованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/ИФРС17_ВыделениеГруппПодгруппНПО/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ПолучитьТекстЗапросаПоВнутреннимДаннымПС")
Функция ХМПолучитьТекстЗапросаПоВнутреннимДаннымПС()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетаНПО.НомерСтроки КАК НомерСтроки,
	|	СчетаНПО.НомерСчета КАК НомерСчета
	|ПОМЕСТИТЬ ВТ_СчетаНПО
	|ИЗ
	|	&СчетаНПО КАК СчетаНПО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РезервыОстатки.НомерСчета КАК НомерСчета,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОстатки.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ИПС)
	|				ТОГДА уп_РезервыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокИПС,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОстатки.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.СПС)
	|				ТОГДА уп_РезервыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокСПС,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОстатки.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ПожизненныхВыплат)
	|				ТОГДА уп_РезервыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокРПВ
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.уп_Резервы.Остатки(
	|			&ДатаДок,
	|			Организация = &Организация
	|				И НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_РезервыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_РезервыОстатки.НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
#Вставка
//++https://redmine.npf.com/issues/4274
	|ВЫБРАТЬ
	|	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|	СУММА(уп_СчетчикНачислений.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ уп_СчетчикНачисленийОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|		уп_СчетчикНачислений.Количество КАК КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаДок, НомерСчета В (ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК хм_СрезСчетчик
	|			ПО уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета
	|				И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния
	|				И (хм_СрезСчетчик.ДатаУстановкиСостояния >= &ДатаНачалаВремен)
	|	ГДЕ
	|		уп_СчетчикНачислений.Период <= &ДатаДок
	|	    И уп_СчетчикНачислений.НомерСчета В (ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)
	|		И уп_СчетчикНачислений.Период >= &ДатаНачалаВремен
	|		И хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		хм_СрезСчетчик.НомерСчета,
	|		хм_СрезСчетчик.Количество
	|	ИЗ
	|		РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаДок, НомерСчета В (ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК хм_СрезСчетчик
	|	ГДЕ
	|		хм_СрезСчетчик.ДатаУстановкиСостояния >= &ДатаНачалаВремен	
	|
	|
	|) КАК уп_СчетчикНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_СчетчикНачислений.НомерСчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
#КонецВставки
	|ВЫБРАТЬ
	|	уп_СостоянияПССрезПоследних.Состояние КАК Состояние,
	|	ВТ_СчетаНПО.НомерСтроки КАК НомерСтроки,
	|	ВТ_СчетаНПО.НомерСчета КАК НомерСчета,
	|	ВЫБОР
	|		КОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии <> ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПустаяСсылка)
	|			ТОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии
	|		КОГДА уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.Смешанная)
	|			ТОГДА уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемыДляПрогнозов
	|		ИНАЧЕ уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
	|	КОНЕЦ КАК ТипПенсионнойСхемы,
	|	уп_СхемаСчетаСрезПоследних.Схема КАК Схема,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник КАК Участник,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник.уп_ФизЛицо.Пол КАК Пол,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	уп_СхемаСчетаСрезПоследних.Схема.ФиксированныеВыплаты КАК ПризнакФиксированнойВыплаты,
	|	уп_РазмерПенсииСрезПоследних.Размер КАК РазмерПенсии,
	|	ВЫБОР
	|		КОГДА уп_ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат = ЗНАЧЕНИЕ(Перечисление.уп_ПериодичностьВыплат.Ежеквартально)
	|			ТОГДА 3
	|		КОГДА уп_ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат = ЗНАЧЕНИЕ(Перечисление.уп_ПериодичностьВыплат.Полугодие)
	|			ТОГДА 6
	|		КОГДА уп_ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат = ЗНАЧЕНИЕ(Перечисление.уп_ПериодичностьВыплат.Ежегодно)
	|			ТОГДА 12
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентПериодичностиВыплат,
	|	ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) КАК КоличествоОставшихсяВыплат,
	|	ВТ_Остатки.СуммаОстатокИПС КАК ОстатокНаИПС,
	|	ВТ_Остатки.СуммаОстатокСПС КАК ОстатокНаСПС,
	|	ВТ_Остатки.СуммаОстатокРПВ КАК ОстатоквРПВ,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Код КАК IDПенсионногоСчета,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник.Код КАК IDУчастника
	|ИЗ
	|	ВТ_СчетаНПО КАК ВТ_СчетаНПО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|						(ВЫБРАТЬ
	|							ВТ_СчетаНПО.НомерСчета
	|						ИЗ
	|							ВТ_СчетаНПО)
	|					И НомерСчета.Участник.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)) КАК уп_СостоянияПССрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_СостоянияПССрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_СхемаСчетаСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_СхемаСчетаСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПериодичностьВыплат.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_ПериодичностьВыплатСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_ПериодичностьВыплатСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_РазмерПенсии.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_РазмерПенсииСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_РазмерПенсииСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_КоличествоНазначенныхВыплат.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_КоличествоНазначенныхВыплатСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_КоличествоНазначенныхВыплатСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_СчетаНПО.НомерСчета = ВТ_Остатки.НомерСчета
#Вставка
//++https://redmine.npf.com/issues/4274
	|		ЛЕВОЕ СОЕДИНЕНИЕ уп_СчетчикНачисленийОбороты КАК уп_СчетчикНачисленийОбороты
//--https://redmine.npf.com/issues/4274
#КонецВставки
#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_СчетчикНачислений.Обороты(
	|				&ДатаНачалаВремен,
	|				&ДатаДок,
	|				Период,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_СчетчикНачисленийОбороты
#КонецУдаления
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_СчетчикНачисленийОбороты.НомерСчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Возврат ТекстЗапроса;
КонецФункции

&НаСервере
&ИзменениеИКонтроль("РассчитатьНаСервереПоСчетам")
Процедура ХМРассчитатьНаСервереПоСчетам()
	//считать будем как внешний источник данных, т.к. надо убрать общие резервы - РПВ и СПС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетаНПО.НомерСтроки КАК НомерСтроки,
	|	СчетаНПО.НомерСчета КАК НомерСчета
	|ПОМЕСТИТЬ ВТ_СчетаНПО
	|ИЗ
	|	&СчетаНПО КАК СчетаНПО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РезервыОстатки.НомерСчета КАК НомерСчета,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОстатки.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ИПС)
	|				ТОГДА уп_РезервыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокИПС,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОстатки.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.СПС)
	|				ТОГДА уп_РезервыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокСПС,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОстатки.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ПожизненныхВыплат)
	|				ТОГДА уп_РезервыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокРПВ
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.уп_Резервы.Остатки(
	|			&ДатаДок,
	|			Организация = &Организация
	|				И НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_РезервыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_РезервыОстатки.НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
#Вставка
//++https://redmine.npf.com/issues/4274
	|ВЫБРАТЬ
	|	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|	СУММА(уп_СчетчикНачислений.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ уп_СчетчикНачисленийОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|		уп_СчетчикНачислений.Количество КАК КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаДок, НомерСчета В (ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК хм_СрезСчетчик
	|			ПО уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета
	|				И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния
	|				И (хм_СрезСчетчик.ДатаУстановкиСостояния >= &ДатаНачалаВремен)
	|	ГДЕ
	|		уп_СчетчикНачислений.Период <= &ДатаДок
	|	    И уп_СчетчикНачислений.НомерСчета В (ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)
	|		И уп_СчетчикНачислений.Период >= &ДатаНачалаВремен
	|		И хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		хм_СрезСчетчик.НомерСчета,
	|		хм_СрезСчетчик.Количество
	|	ИЗ
	|		РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаДок, НомерСчета В (ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК хм_СрезСчетчик
	|	ГДЕ
	|		хм_СрезСчетчик.ДатаУстановкиСостояния >= &ДатаНачалаВремен	
	|
	|
	|) КАК уп_СчетчикНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_СчетчикНачислений.НомерСчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
#КонецВставки
	|ВЫБРАТЬ
	|	уп_СостоянияПССрезПоследних.Состояние КАК Состояние,
	|	ВТ_СчетаНПО.НомерСтроки КАК НомерСтроки,
	|	ВТ_СчетаНПО.НомерСчета КАК НомерСчета,
	|	ВЫБОР
	|		КОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии <> ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПустаяСсылка)
	|			ТОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии
	|		КОГДА уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.Смешанная)
	|			ТОГДА уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемыДляПрогнозов
	|		ИНАЧЕ уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
	|	КОНЕЦ КАК ТипПенсионнойСхемы,
	|	уп_СхемаСчетаСрезПоследних.Схема КАК Схема,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник КАК Участник,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник.уп_ФизЛицо.Пол КАК Пол,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	уп_СхемаСчетаСрезПоследних.Схема.ФиксированныеВыплаты КАК ПризнакФиксированнойВыплаты,
	|	уп_РазмерПенсииСрезПоследних.Размер КАК РазмерПенсии,
	|	ВЫБОР
	|		КОГДА уп_ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат = ЗНАЧЕНИЕ(Перечисление.уп_ПериодичностьВыплат.Ежеквартально)
	|			ТОГДА 3
	|		КОГДА уп_ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат = ЗНАЧЕНИЕ(Перечисление.уп_ПериодичностьВыплат.Полугодие)
	|			ТОГДА 6
	|		КОГДА уп_ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат = ЗНАЧЕНИЕ(Перечисление.уп_ПериодичностьВыплат.Ежегодно)
	|			ТОГДА 12
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентПериодичностиВыплат,
	|	ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) КАК КоличествоОставшихсяВыплат,
	|	ВТ_Остатки.СуммаОстатокИПС КАК ОстатокНаИПС,
	|	ВТ_Остатки.СуммаОстатокСПС КАК ОстатокНаСПС,
	|	ВТ_Остатки.СуммаОстатокРПВ КАК ОстатоквРПВ,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Код КАК IDПенсионногоСчета,
	|	уп_СостоянияПССрезПоследних.НомерСчета.Участник.Код КАК IDУчастника
	|ИЗ
	|	ВТ_СчетаНПО КАК ВТ_СчетаНПО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|						(ВЫБРАТЬ
	|							ВТ_СчетаНПО.НомерСчета
	|						ИЗ
	|							ВТ_СчетаНПО)
	|					И НомерСчета.Участник.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)) КАК уп_СостоянияПССрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_СостоянияПССрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_СхемаСчетаСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_СхемаСчетаСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПериодичностьВыплат.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_ПериодичностьВыплатСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_ПериодичностьВыплатСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_РазмерПенсии.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_РазмерПенсииСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_РазмерПенсииСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_КоличествоНазначенныхВыплат.СрезПоследних(
	|				&ДатаДок,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_КоличествоНазначенныхВыплатСрезПоследних
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_КоличествоНазначенныхВыплатСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_СчетаНПО.НомерСчета = ВТ_Остатки.НомерСчета
#Вставка
//++https://redmine.npf.com/issues/4274
	|		ЛЕВОЕ СОЕДИНЕНИЕ уп_СчетчикНачисленийОбороты КАК уп_СчетчикНачисленийОбороты
//--https://redmine.npf.com/issues/4274
#КонецВставки
#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_СчетчикНачислений.Обороты(
	|				&ДатаНачалаВремен,
	|				&ДатаДок,
	|				Период,
	|				НомерСчета В
	|					(ВЫБРАТЬ
	|						ВТ_СчетаНПО.НомерСчета
	|					ИЗ
	|						ВТ_СчетаНПО)) КАК уп_СчетчикНачисленийОбороты
#КонецУдаления
	|		ПО ВТ_СчетаНПО.НомерСчета = уп_СчетчикНачисленийОбороты.НомерСчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаНачалаВремен", '19800101');
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетаНПО", Объект.СписокСчетов.Выгрузить());

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивСообщений = Новый Массив;
	ФормироватьРасшифровки = Ложь;
	МассивФайлы = Новый Массив;
	ТаблицаДанных = ИФРС17_РаботаСВнешнимиДанными.СформироватьСтруктуруТаблицыДанныхНПО();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТаблицаДанных.Очистить();
		НовСтрТаблицыДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрТаблицыДанных, ВыборкаДетальныеЗаписи);
		НовСтрТаблицыДанных.ОстатокНаИПС = НовСтрТаблицыДанных.ОстатокНаИПС+НовСтрТаблицыДанных.ОстатокНаСПС;
		НовСтрТаблицыДанных.ОстатокНаСПС = 0;

		ИтогПоДоговору = 0;
		//ИтогПоДоговоруПВ = 0;
		ТаблицаИтогов = Неопределено;
		СтруктураПараметровРасчета = Новый Структура();
		СтруктураПараметровРасчета.Вставить("ТаблицаДожития", Объект.ТаблицаДожития);
		СтруктураПараметровРасчета.Вставить("ПараметрыМодели", Объект.ПараметрыМодели);
		СтруктураПараметровРасчета.Вставить("ФормироватьРасшифровки", ФормироватьРасшифровки);
		СтруктураПараметровРасчета.Вставить("МассивПС", ТаблицаДанных);
		СтруктураПараметровРасчета.Вставить("ИспользоватьВнешниеИсточникиДанных", Истина);
		СтруктураПараметровРасчета.Вставить("ВидРасчета", "Общий итог");

		Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод 
			или ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияПС.ОжиданиеВзносов Тогда
			ТаблицаИтогов = ИФРС17_РасчетОбязательствНПО.РасчетНПОНакопительный(Объект.Организация, Объект.Дата, СтруктураПараметровРасчета, МассивСообщений, МассивФайлы);
			Если ТаблицаИтогов.Количество()>0 Тогда
				ВходДанные = ТаблицаИтогов.Получить(0).ВходящийОстаток;
				//ИтогПоДоговору = ИтогПоДоговору+ВходДанные+ТаблицаИтогов.Итог("ВзносыДисконтированно")+ТаблицаИтогов.Итог("ИДДисконтированно")-ТаблицаИтогов.Итог("ВыплатыДисконтированно")+ТаблицаИтогов.Итог("ДоходыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
				ИтогПоДоговору = ИтогПоДоговору+ВходДанные-ТаблицаИтогов.Итог("ВыплатыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
				//ИтогПоДоговоруПВ = ИтогПоДоговоруПВ+ТаблицаИтогов.Итог("ДоходыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
				//дополним таблицу аквизиционными расходами
				Если ЗначениеЗаполнено(Объект.ПараметрыУчетаАквизиционныхРасходов) Тогда
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("ПараметрыУчетаАквизиционныхРасходов",Объект.ПараметрыУчетаАквизиционныхРасходов);
					СтруктураПараметров.Вставить("ГодГруппы",Объект.ИРФС17_ГруппаДоговоров.Год);
					СтруктураПараметров.Вставить("ДатаРасчета",Объект.Дата);

					ИФРС17_ОбщегоНазначения.ДополнитьАквизиционныеРасходы(ТаблицаИтогов, ТаблицаДанных, СтруктураПараметров);
					ИтогПоДоговору = ИтогПоДоговору-ТаблицаИтогов.Итог("АквизоДисконт");
					//ИтогПоДоговоруПВ = ИтогПоДоговоруПВ-ТаблицаИтогов.Итог("АквизоДисконт");
				КонецЕсли;	
			КонецЕсли;

		ИначеЕсли ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
			или ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
			или ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены Тогда
			Если ВыборкаДетальныеЗаписи.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат Тогда
				ТаблицаИтогов = ИФРС17_РасчетОбязательствНПО.РасчетНПОСрочныеИПС(Объект.Организация, Объект.Дата, СтруктураПараметровРасчета, МассивСообщений, МассивФайлы);
				Если ТаблицаИтогов.Количество()>0 Тогда
					ВходДанные = ТаблицаИтогов.Получить(0).ВходящийОстаток;
					//ИтогПоДоговору = ИтогПоДоговору+ВходДанные+ТаблицаИтогов.Итог("ИДДисконтированно")-ТаблицаИтогов.Итог("ВыплатыДисконтированно")+ТаблицаИтогов.Итог("ДоходыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
					ИтогПоДоговору = ИтогПоДоговору+ВходДанные-ТаблицаИтогов.Итог("ВыплатыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
					//ИтогПоДоговоруПВ = ИтогПоДоговоруПВ+ТаблицаИтогов.Итог("ДоходыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
				КонецЕсли;

				//ТаблицаИтогов = ИФРС17_РасчетОбязательствНПО.РасчетНПОСПС(Объект.Организация, Объект.Дата, Объект.ТаблицаДожития, Объект.ПараметрыМодели, МассивСообщений, ФормироватьРасшифровки, МассивФайлы, ТаблицаДанных, Истина);
				//Если ТаблицаИтогов.Количество()>0 Тогда
				//	ВходДанные = ТаблицаИтогов.Получить(0).ВходящийОстаток;
				//	ИтогПоДоговору = ИтогПоДоговору+ВходДанные-ТаблицаИтогов.Итог("ВыплатыДисконтированно")+ТаблицаИтогов.Итог("ДоходыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
				//КонецЕсли;

			ИначеЕсли ВыборкаДетальныеЗаписи.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				ТаблицаИтогов = ИФРС17_РасчетОбязательствНПО.РасчетНПОПожизненные(Объект.Организация, Объект.Дата, СтруктураПараметровРасчета, МассивСообщений, МассивФайлы);
				Если ТаблицаИтогов.Количество()>0 Тогда
					ВходДанные = ТаблицаИтогов.Получить(0).ВходящийОстаток;
					//ИтогПоДоговору = ИтогПоДоговору+ВходДанные+ТаблицаИтогов.Итог("ИДДисконтированно")-ТаблицаИтогов.Итог("ВыплатыДисконтированно")+ТаблицаИтогов.Итог("ДоходыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
					ИтогПоДоговору = ИтогПоДоговору+ВходДанные-ТаблицаИтогов.Итог("ВыплатыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
					//ИтогПоДоговоруПВ = ИтогПоДоговоруПВ+ТаблицаИтогов.Итог("ДоходыДисконтированно")-ТаблицаИтогов.Итог("РасходыДисконтированно");
				КонецЕсли;
			КонецЕсли;
		Конецесли;
		СтрТЧ = Объект.СписокСчетов.Получить(ВыборкаДетальныеЗаписи.НомерСтроки-1);

		//Если ЗначениеЗаполнено(Объект.ИРФС17_ГруппаДоговоров) И Объект.ИРФС17_ГруппаДоговоров.ПараметрыГруппыДоговоров.ПортфельДоговоровНПО.МодельОценки = Перечисления.ИФРС17_МодельОценки.ПеременноеВознаграждение Тогда
		//	СтрТЧ.Оценка = ИтогПоДоговоруПВ;
		//Иначе
		СтрТЧ.Оценка = ИтогПоДоговору;
		//КонецЕсли;
		Если СтрТЧ.Оценка>=0 Тогда
			СтрТЧ.ПодгруппаПоОценке = СтрТЧ.ПодгруппаТекущая;
		Иначе
			СтрТЧ.ПодгруппаПоОценке = Перечисления.ИФРС17_ВидыОбремененияДоговоров.ОбременительныеДоговоры;
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры
